mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/STM32_WPAN/App/app_thread.c
static void APP_THREAD_DummyReqHandler(void *p_context, otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo);

//static void APP_THREAD_SendNextBuffer(void);
//static void APP_THREAD_SendCoapMsg(char* message, char* ipv6_addr, char* resource, otCoapType type);
//static void APP_THREAD_SendCoapUnicastRequest(char* message, char* ipv6_addr  , char* resource);
static void APP_THREAD_SendCoapUnicastRequest(char *message, uint8_t message_length, char *ipv6_addr, char *resource);

static void APP_THREAD_SendCoapMsg(void *message, uint16_t msgSize, otIp6Address *ipv6_addr, char *resource,
		uint8_t request_ack, otCoapCode coapCode, uint8_t msgID);

//static void APP_THREAD_CoapRequestHandler(otCoapHeader        * pHeader,
//                                  otMessage           * pMessage,
//                                  const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapLightsSimpleRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo);

static void APP_THREAD_CoapLightsComplexRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo);

static void APP_THREAD_CoapToggleLoggingRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo);

static void APP_THREAD_CoapBorderTimeRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo);

static void APP_THREAD_CoapNodeInfoRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo);

static void APP_THREAD_CoapRespHandler_UpdateBorderRouter(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo, otError Result);

static void APP_THREAD_SendCoapMsgForBorderSync(void *message, uint16_t msgSize, otIp6Address *ipv6_addr, char *resource,
		uint8_t request_ack, otCoapCode coapCode, uint8_t msgID);

void APP_THREAD_GetBorderRouterIP(void);
void updateRTC(time_t now);
void APP_THREAD_SendMyInfo(void);
void APP_THREAD_UpdateBorderRouter(void);
void APP_THREAD_SyncWithBorderRouter(void);
/* USER CODE END PFP */

/* Private variables -----------------------------------------------*/
#if (CFG_USB_INTERFACE_ENABLE != 0)
static uint8_t TmpString[C_SIZE_CMD_STRING];
static uint8_t VcpRxBuffer[sizeof(TL_CmdSerial_t)];        /* Received Data over USB are stored in this buffer */
static uint8_t VcpTxBuffer[sizeof(TL_EvtPacket_t) + 254U]; /* Transmit buffer over USB */
#else
#if (CFG_FULL_LOW_POWER == 0)
static uint8_t aRxBuffer[C_SIZE_CMD_STRING];
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

#if (CFG_FULL_LOW_POWER == 0)
static uint8_t CommandString[C_SIZE_CMD_STRING];
#endif /* (CFG_FULL_LOW_POWER == 0) */
static __IO uint16_t indexReceiveChar = 0;
static __IO uint16_t CptReceiveCmdFromUser = 0;

static TL_CmdPacket_t *p_thread_otcmdbuffer;
static TL_EvtPacket_t *p_thread_notif_M0_to_M4;
static __IO uint32_t  CptReceiveMsgFromM0 = 0;
static volatile int FlagReceiveAckFromM0 = 0;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_TH_Config_t ThreadConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ThreadOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ThreadNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ThreadCliCmdBuffer;

static osThreadId_t OsTaskMsgM0ToM4Id;      /* Task managing the M0 to M4 messaging        */
#if (CFG_FULL_LOW_POWER == 0)
static osThreadId_t OsTaskCliId;            /* Task used to manage CLI comamnd             */
#endif /* (CFG_FULL_LOW_POWER == 0) */

/* USER CODE BEGIN PV */
//static otCoapResource OT_Light_Ressource = {C_LIGHT_RESSOURCE, APP_THREAD_DummyReqHandler, (void*)APP_THREAD_CoapRequestHandler, NULL};
static otCoapResource OT_Lights_Complex_Ressource = { C_LIGHTS_SIMPLE_RESSOURCE, APP_THREAD_DummyReqHandler,
		(void*) APP_THREAD_CoapLightsSimpleRequestHandler, NULL };
static otCoapResource OT_Lights_Simple_Ressource = { C_LIGHTS_COMPLEX_RESSOURCE, APP_THREAD_DummyReqHandler,
		(void*) APP_THREAD_CoapLightsComplexRequestHandler, NULL };
static otCoapResource OT_Border_Time_Ressource = { C_BORER_TIME_RESSOURCE, APP_THREAD_DummyReqHandler,
		(void*) APP_THREAD_CoapBorderTimeRequestHandler, NULL };
static otCoapResource OT_Node_Info_Ressource = { C_NODE_INFO_RESSOURCE, APP_THREAD_DummyReqHandler,
		(void*) APP_THREAD_CoapNodeInfoRequestHandler, NULL };

#ifndef DONGLE_CODE
static otCoapResource OT_Toggle_Logging_Ressource = {C_TOGGLE_LOGGING_RESSOURCE, APP_THREAD_DummyReqHandler, (void*)APP_THREAD_CoapToggleLoggingRequestHandler, NULL};
#endif

otMessageInfo OT_MessageInfo = { 0 };
otCoapHeader OT_Header = { 0 };
const char borderSyncResource[15] = "borderTime";
const char borderPacket[15] = "borderLog";
const char capTouchResource[15] = "capTouch";
const char capLocResource[15] = "capLoc";
const char nodeInfoResource[15] = "nodeInfo";

otIp6Address multicastAddr;

struct sendIP_struct {
	char node_type[12];
	char description[12];
	uint8_t uid[8];
};

//static uint8_t OT_Command = 0;
//static uint16_t OT_BufferIdRead = 1U;
//static uint16_t OT_BufferIdSend = 1U;

static otMessage *pOT_Message = NULL;
//static otIp6Address   OT_PeerAddress = { .mFields.m8 = { 0 } };

const otMasterKey masterKey = { 0x33, 0x33, 0x44, 0x44, 0x33, 0x33, 0x44, 0x44, 0x33, 0x33, 0x44, 0x44, 0x33, 0x33,
		0x44, 0x44 };
const otExtendedPanId extendedPanId = { 0x11, 0x11, 0x11, 0x11, 0x22, 0x22, 0x22, 0x22 };
const char networkName[20] = "PatrickNetwork";

//otIp6Address binary_border_ipv6;
//static char border_ipv6[100] = "fd11:22::994e:6ed7:263d:6187";
//static char border_ipv6[50] = 0x0;

//static char border_ipv6[100] = "FF03::1";
//const char border_ipv6[50] = "fd33:3333:3344:0:0:ff:fe00:e400";
otError error = OT_ERROR_NONE;
static uint8_t OT_ReceivedCommand = 0;
static char OT_BufferSend[20] = "TEST PAYLOAD";
volatile otIp6Address *myAddress;
volatile otMessageInfo *tempMessageInfo;
volatile uint16_t myRloc16;
volatile otNetifAddress *unicastAddresses;

