mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/STM32_WPAN/App/app_thread.c
}

static void APP_THREAD_TimingElapsed(void)
{
  BSP_LED_Toggle(LED1);
}

#endif

//void APP_THREAD_GetBorderRouterIP(){
//	APP_THREAD_SendCoapUnicastRequest(NULL, NULL, MULICAST_FTD_BORDER_ROUTER, borderSyncResource);
//}


//char msgSendMyIP[5] = "cal";
////otIp6Address* test_ip;
//otNeighborInfo test_info_neighbor;
//otNeighborInfoIterator test_neighbor_iterator;
//otError error;
//
//volatile uint8_t random_var = 0;
//volatile bool state = 1;
//volatile otNetifMulticastAddress *test_addr;
//volatile otExtAddress *test_ext_addr;
//volatile otExtAddress test_1;
//volatile otExtAddress test_2;

void APP_THREAD_UpdateBorderRouter() {

	// if border router IP is still multicast (ff03::1), attempt to sync
	if (otIp6IsAddressEqual(&multicastAddr, &borderRouter.ipv6)) {
		APP_THREAD_SyncWithBorderRouter();
		APP_THREAD_SendMyInfo();
	}

	// send IP to border router
	//APP_THREAD_SendMyInfo();
}

// send a GET request to border router via multicast
void APP_THREAD_SyncWithBorderRouter() {
	APP_THREAD_SendCoapMsgForBorderSync(NULL, 0, &multicastAddr, borderSyncResource, NO_ACK, OT_COAP_CODE_GET, 1U);
}

void APP_THREAD_SendMyInfo() {
//	msgSendMyIP.uid = DBGMCU->IDCODE;
//	const otIp6Address *test_ip = otThreadGetLinkLocalIp6Address(NULL);
//	if(test_ip) random_var++;
//	state = otIp6IsMulticastPromiscuousEnabled(NULL);
//	test_addr = otIp6GetMulticastAddresses(NULL);
//	test_ext_addr = otLinkGetExtendedAddress(NULL);
//	memcpy(&test_1, test_ext_addr, sizeof(otExtAddress));
////	test_1 = test_ext_addr[0];
////	test_2 = &test_ext_addr;
//
//	error = otThreadGetNextNeighborInfo(NULL, &test_neighbor_iterator, &test_info_neighbor);
	// TODO: does this need an ACK
	APP_THREAD_SendCoapMsg(&msgSendMyIP, sizeof(msgSendMyIP), &borderRouter.ipv6, nodeInfoResource, NO_ACK,
			OT_COAP_CODE_PUT, 1U);
//	APP_THREAD_SendCoapUnicastMsg(NULL, NULL, borderRouter.ipv6  , borderSyncResource, 1U);
}

void APP_THREAD_SendBorderMessage(void *packet, uint8_t len, char *resource) {
//	APP_THREAD_SendCoapMsg(sensorPacket, borderRouter.ipv6, borderPacket, otCoapType type);
	APP_THREAD_SendCoapMsg(packet, len, &borderRouter.ipv6, resource, NO_ACK, OT_COAP_CODE_PUT, 1U);
}

void APP_THREAD_SendBorderPacket(struct LogPacket *sensorPacket) {
//	APP_THREAD_SendCoapMsg(sensorPacket, borderRouter.ipv6, borderPacket, otCoapType type);
	APP_THREAD_SendCoapMsg(sensorPacket, sizeof(struct LogPacket), &borderRouter.ipv6, borderPacket, NO_ACK,
			OT_COAP_CODE_PUT, 1U);

}

static void APP_THREAD_CoapLightsSimpleRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {

		// if get, send response with current log message
		if (otCoapHeaderGetType(pHeader) == OT_COAP_CODE_GET) {
			APP_THREAD_SendDataResponse(pHeader, pMessageInfo, &lightsSimpleMessage, sizeof(lightsSimpleMessage));
			break;
		}

		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &lightsSimpleMessage, sizeof(lightsSimpleMessage))
				== 4U) {
			if ((otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_PUT)
					|| (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_POST)) {
				osMessageQueuePut(lightsSimpleQueueHandle, &lightsSimpleMessage, 0U, 0U);
			}

		}

		tempMessageInfo = pMessageInfo;
		receivedMessage = (otMessageInfo*) pMessage;

		if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE) {
			APP_THREAD_SendDataResponse(pHeader, pMessageInfo, NULL, 0);
			break;
		}

		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_ReceivedCommand, 1U) != 1U) {
			//APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
		}

		if (OT_ReceivedCommand == 1U) {
			//BSP_LED_Toggle(LED1);
		}
	} while (false);
}

#ifndef DONGLE_CODE
// request handler for when receiving a message directed at the data logging resource
static void APP_THREAD_CoapToggleLoggingRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {
		// if get, send response with current log message
		if (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET) {
			APP_THREAD_SendDataResponse(&logMessage, sizeof(logMessage), pHeader, pMessageInfo);
			break;
		}

		// TODO : this will overwrite log message so maybe add a safer method
		if ( otMessageRead(pMessage, otMessageGetOffset(pMessage), &logMessage, sizeof(logMessage)) == sizeof(logMessage)){
//			otMessageRead(pMessage, otMessageGetOffset(pMessage), &logMessage, sizeof(logMessage));
			// if post or put, add to queue for masterthread processing
			if ((otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_PUT)
					|| (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_POST)) {
				osMessageQueuePut(togLoggingQueueHandle, &logMessage, 0U, 0U);
			}
		}


		if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE) {
			APP_THREAD_SendDataResponse(NULL, 0, pHeader, pMessageInfo);
			break;
		}

	} while (false);
}

#endif


// request handler for when receiving a message directed at the border router synchronizing resource
static void APP_THREAD_CoapBorderTimeRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {
#ifdef DONGLE_CODE
		BSP_LED_Toggle(LED_RED);
#endif
		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &receivedSystemCal, sizeof(receivedSystemCal))
				== sizeof(receivedSystemCal)) {
			// if the message was a put request, copy message over to border router info struct
			if ((otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_PUT)
					|| (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_POST)) {

				memcpy(&borderRouter, &receivedSystemCal, sizeof(receivedSystemCal));

				// update the onboard RTC unix time
				updateRTC(borderRouter.epoch);
			}
		}

		receivedMessage = (otMessageInfo*) pMessage;

		if (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET) {

			//TODO: this is where you would put the return if you wanted a node to transmit BR info to other nodes
//			APP_THREAD_SendDataResponse(&borderRouter, sizeof(borderRouter), pHeader, pMessageInfo);
			break;
		}

		if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE) {
			APP_THREAD_SendDataResponse(NULL, 0 , pHeader, pMessageInfo);
			break;
		}

	} while (false);
}

// Only get requests allowed for this resource
struct sendIP_struct tempVar = {"test","test",0};
//char test_string[200] = "test";
static void APP_THREAD_CoapNodeInfoRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {
#ifdef DONGLE_CODE
		BSP_LED_Toggle(LED_RED);
#endif

