mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/STM32_WPAN/App/app_thread.c
//		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &tempVar, sizeof(tempVar))
//				== sizeof(tempVar)) {
//			// if the message was a put request, copy message over to border router info struct
////			if ((otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_PUT)
////					|| (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_POST)) {
////
////				memcpy(&borderRouter, &receivedSystemCal, sizeof(receivedSystemCal));
////
////				// update the onboard RTC unix time
////				updateRTC(borderRouter.epoch);
////			}
//		}

//		receivedMessage = (otMessageInfo*) pMessage;

		// send info if requested
		if (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET) {
//			APP_THREAD_SendDataResponse(&borderRouter, sizeof(borderRouter), pHeader, pMessageInfo);
//			APP_THREAD_SendDataResponse(&msgSendMyIP, sizeof(msgSendMyIP), pHeader, pMessageInfo);
			APP_THREAD_SendMyInfo();

			break;
		}

		if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE) {
			APP_THREAD_SendDataResponse(NULL, 0, pHeader, pMessageInfo);
		}

	} while (false);
}

void updateRTC(time_t now) {

	RTC_TimeTypeDef sTime;
	RTC_DateTypeDef sDate;

	// https://www.st.com/content/ccc/resource/technical/document/application_note/2a/c2/6f/74/fa/0d/46/3a/CD00015424.pdf/files/CD00015424.pdf/jcr:content/translations/en.CD00015424.pdf
//	struct tm *time_tm;

	RTC_FromEpoch(now, &sTime, &sDate);

	if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK) {
	}

	/*
	 * update the RTC
	 */
	if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK) {
	}

	HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, 0x32F2); // lock it in with the backup registers
}

/**
 * @brief  This function compute the next message to be send
 * @param  None
 * @retval None
 */
//static void APP_THREAD_SendNextBuffer(void)
//{
//  uint16_t j;
//  uint16_t mOffset;
//
//  if (OT_BufferIdSend < 5U)
//  {
//    /* Prepare next buffers to be send */
//    OT_BufferIdSend++;
//    mOffset=(OT_BufferIdSend - 1U) * COAP_PAYLOAD_MAX_LENGTH;
//
//    memset(OT_BufferSend, 0, COAP_PAYLOAD_MAX_LENGTH);
//    for(j = mOffset; j < mOffset + COAP_PAYLOAD_MAX_LENGTH; j++)
//    {
//      OT_BufferSend[j - mOffset] = aDataBuffer[j];
//    }
//
//    /* Send the data in unicast mode */
//    APP_THREAD_SendCoapUnicastRequest();
//  }
//  else
//  {
//    /* Buffer transfer has been successfully  transfered */
//    BSP_LED_On(LED1);
//    APP_DBG(" ********* BUFFER HAS BEEN TRANFERED \r\n");
//  }
//}
static void APP_THREAD_CoapLightsComplexRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {
		//APP_THREAD_SendCoapUnicastRequest();

		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &lightMessageComplex, sizeof(lightMessageComplex))
				== sizeof(lightMessageComplex)) {
			FrontLightsSet(&lightMessageComplex);
		}

		tempMessageInfo = pMessageInfo;
		receivedMessage = (otMessageInfo*) pMessage;

		if (otCoapHeaderGetType(pHeader) != OT_COAP_TYPE_NON_CONFIRMABLE) {
			break;
		}

		if (otCoapHeaderGetCode(pHeader) != OT_COAP_CODE_PUT) {
			break;
		}

		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_ReceivedCommand, 1U) != 1U) {
			//APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
		}

		if (OT_ReceivedCommand == 1U) {
			//BSP_LED_Toggle(LED1);
		}

	} while (false);
}

/**
 * @brief Initialize CoAP write buffer.
 * @param  None
 * @retval None
 */
//static void APP_THREAD_InitPayloadWrite(void)
//{
//  uint8_t i;
//  for(i = 0; i < COAP_PAYLOAD_LENGTH; i++)
//  {
//    PayloadWrite[i] = 0xFF;
//  }
//}
///**
// * @brief  Compare the message received versus the original message.
// * @param  None
// * @retval None
// */
//static bool APP_THREAD_CheckMsgValidity(void)
//{
//  bool valid = true;
//  uint32_t i;
//
//  for(i = 0; i < COAP_PAYLOAD_LENGTH; i++)
//  {
//    if(PayloadRead[i] != PayloadWrite[i])
//    {
//      valid = false;
//    }
//  }
//
//  if(valid == true)
//  {
//    APP_DBG("PAYLOAD Comparison OK!");
//  }else
//  {
//    APP_THREAD_Error(ERR_THREAD_MSG_COMPARE_FAILED, 0);
//  }
//  return valid;
//}
//static void APP_THREAD_SendCoapUnicastRequest()
//{
//  //otError   error = OT_ERROR_NONE;
//
////  if (error != OT_ERROR_NONE)
////  {
////    APP_THREAD_Error(ERR_APEND_URI,error);
////  }
////  if (pOT_Message == NULL)
////  {
////    APP_THREAD_Error(ERR_ALLOC_MSG,error);
////  }
//  //error = otMessageAppend(pOT_Message, &OT_BufferSend, sizeof(OT_BufferSend));
////  if (error != OT_ERROR_NONE)
////  {
////    APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
////  }
//
////  memcpy(&OT_MessageInfo.mPeerAddr, &OT_PeerAddress, sizeof(OT_MessageInfo.mPeerAddr));
////  error = otCoapSendRequest(NULL,
////          pOT_Message,
////          &OT_MessageInfo,
////          &APP_THREAD_DummyRespHandler,
////          (void*)&APP_THREAD_DataRespHandler);
//
//  /************ SET MESSAGE INFO (WHERE THE PACKET GOES) ************/
//  // https://openthread.io/reference/struct/ot-message-info.html#structot_message_info
//
//	do{
////			  myRloc16 = otThreadGetRloc16(NULL);
////			  unicastAddresses = otIp6GetUnicastAddresses(NULL);
////			  isEnabledIpv6 = otIp6IsEnabled(NULL);
////			  multicastAddresses = otIp6GetMulticastAddresses(NULL);
////			  meshLocalEID =  otThreadGetMeshLocalEid(NULL);
////			  linkLocalIPV6 = otThreadGetLinkLocalIp6Address(NULL);
//
//
//			  // clear info
//			  memset(&OT_MessageInfo, 0, sizeof(OT_MessageInfo));
//
//			  // set border IP address
//			   error = otIp6AddressFromString("ff03::1", &OT_MessageInfo.mPeerAddr);
//
//			   memcpy(&OT_MessageInfo.mSockAddr, otThreadGetMeshLocalEid(NULL), sizeof(OT_MessageInfo.mSockAddr));
//
//			   // error = otIp6AddressFromString("fd11:22::994e:6ed7:263d:6187", &OT_MessageInfo.mPeerAddr);
//			  //error = otIp6AddressFromString("fdde:ad00:beef:0:0:ff:fe00:3800", &OT_MessageInfo.mPeerAddr);
//
//			  OT_MessageInfo.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
//			  OT_MessageInfo.mPeerPort = OT_DEFAULT_COAP_PORT;
//			  //OT_MessageInfo.mHopLimit = 20;
//
//			  /************** CREATE NEW MESSAGE ********************ifco*/
//
//			  // create header
//			  otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT);
//			  //otCoapHeaderSetMessageId(&OT_Header,OT_BufferIdSend); //may not need since sendRequest should set to 0
//			  otCoapHeaderGenerateToken(&OT_Header, 2U); //This function sets the Token length and randomizes its value.
//
//			  // the name of the resource
//			  //error = otCoapHeaderAppendUriPathOptions(&OT_Header,C_RESSOURCE_BASIC);
//			  error = otCoapHeaderAppendUriPathOptions(&OT_Header,"light");
//
//			  // This function adds Payload Marker indicating beginning of the payload to the CoAP header
//			  otCoapHeaderSetPayloadMarker(&OT_Header);
//
//			  // creates new message with headers but with empty payload
//			  pOT_Message = otCoapNewMessage(NULL, &OT_Header);
//			  if (pOT_Message == NULL) while(1);
//			  // Append bytes to a message (this is where the payload gets added)
//
//			  //error = otMessageAppend(pOT_Message, OT_BufferSend, sizeof(OT_BufferSend));
//			  error = otMessageAppend(pOT_Message, &OT_MessageInfo, sizeof(OT_MessageInfo));
//
//			  if (error != OT_ERROR_NONE) while(1);
//
//			  error = otCoapSendRequest(NULL,
//						pOT_Message,
//						&OT_MessageInfo,
//						NULL,
//						(void*) NULL);
//
//			  // if error: free allocated message buffer if one was allocated
//			  if (error != OT_ERROR_NONE && pOT_Message != NULL)
//			  {
//				otMessageFree(pOT_Message);
//			  }
//
//			  //HAL_Delay(10000);
//			}while(false);
//
//}
//static void APP_THREAD_SendCoapUnicastRequest()
//{
//  //otError   error = OT_ERROR_NONE;
//
////  if (error != OT_ERROR_NONE)
////  {
////    APP_THREAD_Error(ERR_APEND_URI,error);
////  }
////  if (pOT_Message == NULL)
////  {
////    APP_THREAD_Error(ERR_ALLOC_MSG,error);
////  }
//  //error = otMessageAppend(pOT_Message, &OT_BufferSend, sizeof(OT_BufferSend));
////  if (error != OT_ERROR_NONE)
////  {
////    APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
////  }
//
////  memcpy(&OT_MessageInfo.mPeerAddr, &OT_PeerAddress, sizeof(OT_MessageInfo.mPeerAddr));
////  error = otCoapSendRequest(NULL,
////          pOT_Message,
////          &OT_MessageInfo,
////          &APP_THREAD_DummyRespHandler,
////          (void*)&APP_THREAD_DataRespHandler);
//
//  /************ SET MESSAGE INFO (WHERE THE PACKET GOES) ************/
//  // https://openthread.io/reference/struct/ot-message-info.html#structot_message_info
//
//	do{
////			  myRloc16 = otThreadGetRloc16(NULL);
////			  unicastAddresses = otIp6GetUnicastAddresses(NULL);
////			  isEnabledIpv6 = otIp6IsEnabled(NULL);
////			  multicastAddresses = otIp6GetMulticastAddresses(NULL);
////			  meshLocalEID =  otThreadGetMeshLocalEid(NULL);
////			  linkLocalIPV6 = otThreadGetLinkLocalIp6Address(NULL);
//
//
//			  // clear info
//			  memset(&OT_MessageInfo, 0, sizeof(OT_MessageInfo));
//
//			  // set border IP address
//			   //error = otIp6AddressFromString("ff03::1", &OT_MessageInfo.mPeerAddr);
//			   error = otIp6AddressFromString(borderRouter.ipv6, &OT_MessageInfo.mPeerAddr);
//
//
//			   memcpy(&OT_MessageInfo.mSockAddr, otThreadGetMeshLocalEid(NULL), sizeof(OT_MessageInfo.mSockAddr));
//
//			   // error = otIp6AddressFromString("fd11:22::994e:6ed7:263d:6187", &OT_MessageInfo.mPeerAddr);
//			  //error = otIp6AddressFromString("fdde:ad00:beef:0:0:ff:fe00:3800", &OT_MessageInfo.mPeerAddr);
//
//			  OT_MessageInfo.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
//			  OT_MessageInfo.mPeerPort = OT_DEFAULT_COAP_PORT;
//			  //OT_MessageInfo.mHopLimit = 20;
//
//			  /************** CREATE NEW MESSAGE ********************ifco*/
//
//			  // create header
//			  otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT);
//			  //otCoapHeaderSetMessageId(&OT_Header,OT_BufferIdSend); //may not need since sendRequest should set to 0
//			  otCoapHeaderGenerateToken(&OT_Header, 2U); //This function sets the Token length and randomizes its value.
//
//			  // the name of the resource
//			  //error = otCoapHeaderAppendUriPathOptions(&OT_Header,C_RESSOURCE_BASIC);
//			  error = otCoapHeaderAppendUriPathOptions(&OT_Header,"basic");
//
//			  // This function adds Payload Marker indicating beginning of the payload to the CoAP header
//			  otCoapHeaderSetPayloadMarker(&OT_Header);
//
//			  // creates new message with headers but with empty payload
//			  pOT_Message = otCoapNewMessage(NULL, &OT_Header);
//			  if (pOT_Message == NULL) while(1);
//			  // Append bytes to a message (this is where the payload gets added)
//
//			  //error = otMessageAppend(pOT_Message, OT_BufferSend, sizeof(OT_BufferSend));
//			  error = otMessageAppend(pOT_Message, &OT_MessageInfo, sizeof(OT_MessageInfo));
//
//			  if (error != OT_ERROR_NONE) while(1);
//
//			  error = otCoapSendRequest(NULL,
//						pOT_Message,
//						&OT_MessageInfo,
//						NULL,
//						(void*) NULL);
//
//			  // if error: free allocated message buffer if one was allocated
//			  if (error != OT_ERROR_NONE && pOT_Message != NULL)
//			  {
//				otMessageFree(pOT_Message);
//			  }
//
//			  //HAL_Delay(10000);
//			}while(false);
//
//}
volatile otNetifMulticastAddress multicastAddresses;
volatile otIp6Address meshLocalEID;
volatile otIp6Address linkLocalIPV6;

static void APP_THREAD_SendCoapUnicastRequest(char *message, uint8_t message_length, char *ipv6_addr, char *resource) {
	//otError   error = OT_ERROR_NONE;

//  if (error != OT_ERROR_NONE)
//  {
//    APP_THREAD_Error(ERR_APEND_URI,error);
//  }
//  if (pOT_Message == NULL)
//  {
//    APP_THREAD_Error(ERR_ALLOC_MSG,error);
//  }
	//error = otMessageAppend(pOT_Message, &OT_BufferSend, sizeof(OT_BufferSend));
//  if (error != OT_ERROR_NONE)
//  {
//    APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
//  }

//  memcpy(&OT_MessageInfo.mPeerAddr, &OT_PeerAddress, sizeof(OT_MessageInfo.mPeerAddr));
//  error = otCoapSendRequest(NULL,
//          pOT_Message,
//          &OT_MessageInfo,
//          &APP_THREAD_DummyRespHandler,
//          (void*)&APP_THREAD_DataRespHandler);

	/************ SET MESSAGE INFO (WHERE THE PACKET GOES) ************/
	// https://openthread.io/reference/struct/ot-message-info.html#structot_message_info
	do {
//			  myRloc16 = otThreadGetRloc16(NULL);
//			  isEnabledIpv6 = otIp6IsEnabled(NULL);
//			  multicastAddresses = otIp6GetMulticastAddresses(NULL);
//			  meshLocalEID =  otThreadGetMeshLocalEid(NULL);
//			  linkLocalIPV6 = otThreadGetLinkLocalIp6Address(NULL);
		memcpy(&meshLocalEID, otThreadGetMeshLocalEid(NULL), sizeof(otIp6Address));

