mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/STM32_WPAN/App/app_thread.c
		// clear info
		memset(&OT_MessageInfo, 0, sizeof(OT_MessageInfo));

		// set border IP address
		//error = otIp6AddressFromString("ff03::1", &OT_MessageInfo.mPeerAddr);
		error = otIp6AddressFromString(ipv6_addr, &OT_MessageInfo.mPeerAddr);

		memcpy(&OT_MessageInfo.mSockAddr, otThreadGetMeshLocalEid(NULL), sizeof(OT_MessageInfo.mSockAddr));

		// error = otIp6AddressFromString("fd11:22::994e:6ed7:263d:6187", &OT_MessageInfo.mPeerAddr);
		//error = otIp6AddressFromString("fdde:ad00:beef:0:0:ff:fe00:3800", &OT_MessageInfo.mPeerAddr);

		OT_MessageInfo.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
		OT_MessageInfo.mPeerPort = OT_DEFAULT_COAP_PORT;

		unicastAddresses = otIp6GetUnicastAddresses(NULL);
		OT_MessageInfo.mSockAddr = unicastAddresses->mAddress;
		//OT_MessageInfo.mHopLimit = 20;

		/************** CREATE NEW MESSAGE ********************ifco*/

		// create header
		otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT);
		//otCoapHeaderSetMessageId(&OT_Header,OT_BufferIdSend); //may not need since sendRequest should set to 0
		otCoapHeaderGenerateToken(&OT_Header, 2U); //This function sets the Token length and randomizes its value.

		// the name of the resource
		//error = otCoapHeaderAppendUriPathOptions(&OT_Header,C_RESSOURCE_BASIC);
		error = otCoapHeaderAppendUriPathOptions(&OT_Header, resource);

		// This function adds Payload Marker indicating beginning of the payload to the CoAP header
		otCoapHeaderSetPayloadMarker(&OT_Header);

		// creates new message with headers but with empty payload
		pOT_Message = otCoapNewMessage(NULL, &OT_Header);
//		if (pOT_Message == NULL)
//			while (1)
//				;
		// Append bytes to a message (this is where the payload gets added)

		//error = otMessageAppend(pOT_Message, OT_BufferSend, sizeof(OT_BufferSend));
//			  error = otMessageAppend(pOT_Message, &OT_MessageInfo, sizeof(OT_MessageInfo));
		error = otMessageAppend(pOT_Message, message, message_length);

		if (error != OT_ERROR_NONE)
			while (1)
				;

		error = otCoapSendRequest(NULL, pOT_Message, &OT_MessageInfo,
		NULL, (void*) NULL);

		// if error: free allocated message buffer if one was allocated
		if (error != OT_ERROR_NONE && pOT_Message != NULL) {
			otMessageFree(pOT_Message);
		}

		//HAL_Delay(10000);
	} while (false);

}

//static void APP_THREAD_CoapSendRequest(otCoapResource* pCoapRessource,
//    otCoapType CoapType,
//    otCoapCode CoapCode,
//    const char *Address,
//    uint8_t* Payload,
//    uint16_t Size)
//{
//  otError error = OT_ERROR_NONE;
//
//  do{
//    otCoapHeaderInit(&OT_Header, CoapType, CoapCode);
//    otCoapHeaderAppendUriPathOptions(&OT_Header, pCoapRessource->mUriPath);
//    otCoapHeaderSetPayloadMarker(&OT_Header);
//
//    pOT_Message = otCoapNewMessage(NULL, &OT_Header);
//    if (pOT_Message == NULL)
//    {
//      APP_THREAD_Error(ERR_THREAD_COAP_NEW_MSG,error);
//      break;
//    }
//
//    error = otMessageAppend(pOT_Message, Payload, Size);
//    if (error != OT_ERROR_NONE)
//    {
//      APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
//      break;
//    }
//
//    memset(&OT_MessageInfo, 0, sizeof(OT_MessageInfo));
//    OT_MessageInfo.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
//    OT_MessageInfo.mPeerPort = OT_DEFAULT_COAP_PORT;
//    otIp6AddressFromString(Address, &OT_MessageInfo.mPeerAddr);
//
//    APP_DBG(" otCoapSendRequest, Payload = 0x%x ", Payload[0]);
//    if(CoapType == OT_COAP_TYPE_NON_CONFIRMABLE)
//    {
//      APP_DBG("CoapType == OT_COAP_TYPE_NON_CONFIRMABLE");
//      error = otCoapSendRequest(NULL,
//          pOT_Message,
//          &OT_MessageInfo,
//          NULL,
//          NULL);
//    }
//    if(CoapType == OT_COAP_TYPE_CONFIRMABLE)
//    {
//      APP_DBG("CoapType == OT_COAP_TYPE_CONFIRMABLE");
//      error = otCoapSendRequest(NULL,
//          pOT_Message,
//          &OT_MessageInfo,
//          &APP_THREAD_CoapDummyRespHandler,
//          (void*)&APP_THREAD_CoapDataRespHandler);
//    }
//
//  }while(false);
//  if (error != OT_ERROR_NONE && pOT_Message != NULL)
//  {
//    otMessageFree(pOT_Message);
//    APP_THREAD_Error(ERR_THREAD_COAP_SEND_REQUEST,error);
//  }
//}

static char empty_message[10] = "";
static void APP_THREAD_SendCoapMsg(void *message, uint16_t msgSize, otIp6Address *ipv6_addr, char *resource,
		uint8_t request_ack, otCoapCode coapCode, uint8_t msgID) {
	/************ SET MESSAGE INFO (WHERE THE PACKET GOES) ************/
	// https://openthread.io/reference/struct/ot-message-info.html#structot_message_info
	do {
		// REMOVE BELOW CALLS (ONLY FOR DEBUGGING)
//			  myRloc16 = otThreadGetRloc16(NULL);
//			  unicastAddresses = otIp6GetUnicastAddresses(NULL);
//			  isEnabledIpv6 = otIp6IsEnabled(NULL);
//			  multicastAddresses = otIp6GetMulticastAddresses(NULL);
//			  meshLocalEID =  otThreadGetMeshLocalEid(NULL);
//			  linkLocalIPV6 = otThreadGetLinkLocalIp6Address(NULL);

		// clear info
		memset(&OT_MessageInfo, 0, sizeof(OT_MessageInfo));

		// add destination IPv6 address to header
		// TODO : swap the below statements once ST has their shit fixed

		if(msgSize > 100){ // TODO : semd to borderRouter if the message is a log message (this is a temporary fix)
			memcpy(&OT_MessageInfo.mPeerAddr, &borderRouter.ipv6, sizeof(otIp6Address));
			otIp6AddressFromString("fd11:22::c34c:7994:cccc:4b82", &OT_MessageInfo.mSockAddr);
		}else{
			memcpy(&OT_MessageInfo.mPeerAddr, &multicastAddr, sizeof(otIp6Address));
		}

//			  memcpy(&OT_MessageInfo.mPeerAddr, ipv6_addr, sizeof(otIp6Address));

		// add source mesh-local IPv6 address to header
		// TODO: ST is supposed to address the issue in FW v1.5 but currently, the IP lookup function returns a null pointer
		// memcpy(&OT_MessageInfo.mSockAddr, otThreadGetMeshLocalEid(NULL), sizeof(OT_MessageInfo.mSockAddr));

		// REMOVE BELOW CALLS (ONLY FOR DEBUGGING)
		//			  otIp6AddressFromString("fd11:22::c55e:6732:c8cd:9443", &OT_MessageInfo.mPeerAddr);
//			  otIp6AddressFromString("fd11:1111:1122:0:7be1:2f12:9534:72d5", &OT_MessageInfo.mPeerAddr);
//			  			  otIp6AddressFromString("fd11:1111:1122:0:4faa:fd9:da06:9100", &OT_MessageInfo.mPeerAddr);
//			  			  otIp6AddressFromString("fd11:22:0:0:c34c:7994:19f2:4b82", &OT_MessageInfo.mPeerAddr);
//			   memcpy(&OT_MessageInfo.mSockAddr, otThreadGetMeshLocalEid(NULL), sizeof(OT_MessageInfo.mSockAddr));
//			  otIp6AddressFromString("fd11:22::c34c:7994:19f2:4b82", &OT_MessageInfo.mSockAddr);

//			  otIp6AddressFromString("fd11:22::c34c:7994:cccc:4b82", &OT_MessageInfo.mSockAddr);

		// populate message information
		OT_MessageInfo.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
		OT_MessageInfo.mPeerPort = OT_DEFAULT_COAP_PORT;
		OT_MessageInfo.mHopLimit = 64;

		/************** CREATE NEW MESSAGE ********************ifco*/

		// create header
		if (request_ack && (coapCode == OT_COAP_CODE_PUT))
			otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_CONFIRMABLE, OT_COAP_CODE_PUT);
		else if (request_ack && (coapCode == OT_COAP_CODE_GET))
			otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_CONFIRMABLE, OT_COAP_CODE_GET);
		else if (request_ack && (coapCode == OT_COAP_CODE_POST))
			otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_CONFIRMABLE, OT_COAP_CODE_POST);
		else if (!request_ack && (coapCode == OT_COAP_CODE_PUT))
			otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT);
		else if (!request_ack && (coapCode == OT_COAP_CODE_GET))
			otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_GET);
		else if (!request_ack && (coapCode == OT_COAP_CODE_POST))
			otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_POST);
		else
			return // this return should never happen

